
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/shimota-dev/aws-ecs-terraform/actions/runs/4776143775)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-008e5722bf30b8142]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-068e23561f8f078c6]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0b187818db468838e]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0feb4c9a6e80d8e33]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0c2c430090da69c66]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0057ecae1b13d1a40]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-043da24431e45029f]
aws_security_group.ecs: Refreshing state... [id=sg-0be0c682e474673e2]
aws_security_group.alb: Refreshing state... [id=sg-018d694f340c980d4]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-033643a06f76e4b0c]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-098322cf3202fb0ac]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b50b2476369bbd39]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-098d91b31f5e3673c]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0846e4a017b57f8f5]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-07de421700351d7bf]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ca4f15a04c6d08c9]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-2223750602]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05c2ce13ee4a00ce3]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-024def2a266365ea4]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-07de421700351d7bf1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c96c0c5544b9b515]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0645b77e410c9fc4c]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-065f54d280fda9f9d]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-012e09e94b920d8cd]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-033643a06f76e4b0c1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-098d91b31f5e3673c1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = (known after apply)
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "go-simple-server-alb"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-018d694f340c980d4",
        ]
      + subnets                                     = [
          + "subnet-098322cf3202fb0ac",
          + "subnet-0ca4f15a04c6d08c9",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-simple-server-target-group"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-008e5722bf30b8142"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:690440254734:targetgroup/go-simple-server-target-group/9fdb956edca04d04]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Creation complete after 2m4s [id=arn:aws:elasticloadbalancing:ap-northeast-1:690440254734:loadbalancer/app/go-simple-server-alb/6d2089c9be21f289]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:690440254734:listener/app/go-simple-server-alb/6d2089c9be21f289/2d9f7b59157388ed]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:690440254734:listener-rule/app/go-simple-server-alb/6d2089c9be21f289/2d9f7b59157388ed/14f32ccd720edba0]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"0fdfd43b930245fb6d5bfa790dd606c8467f132a","Vars":{},"WorkflowName":"Terraform"} -->